<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="detected_boxes" type="Parameter" version="opset1">
			<data shape="1, 256, 4" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Func/PartitionedCall/input/_2:0,detected_boxes:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="detected_scores" type="Parameter" version="opset1">
			<data shape="1, 256" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Func/PartitionedCall/input/_1:0,detected_scores:0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="detected_classes" type="Parameter" version="opset1">
			<data shape="1, 256" element_type="i32"/>
			<output>
				<port id="0" precision="I32" names="Func/PartitionedCall/input/_0:0,detected_classes:0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Func/PartitionedCall/input/_3" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 200, 1" offset="0" size="800"/>
			<output>
				<port id="0" precision="FP32" names="Func/PartitionedCall/input/_3:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="PartitionedCall/model/tf.cast/Cast" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="PartitionedCall/model/tf.cast/Cast:0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="PartitionedCall/model/reshape_1/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="800" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/reshape_1/Reshape/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="PartitionedCall/model/reshape_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="PartitionedCall/model/reshape_1/Reshape:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="PartitionedCall/model/tf.__operators__.getitem/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="832" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem/strided_slice/stack:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="PartitionedCall/model/tf.__operators__.getitem/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="864" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem/strided_slice/stack_1:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="PartitionedCall/model/tf.__operators__.getitem/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="896" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem/strided_slice/stack_2:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="PartitionedCall/model/tf.__operators__.getitem/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1" end_mask="1, 1, 0, 1" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="PartitionedCall/model/tf.__operators__.getitem/strided_slice:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="PartitionedCall/model/reshape_2/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="800" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/reshape_2/Reshape/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="PartitionedCall/model/reshape_2/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="PartitionedCall/model/reshape_2/Reshape:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="PartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="832" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="PartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="864" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_1:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="PartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="896" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_2:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="PartitionedCall/model/tf.__operators__.getitem_1/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1" end_mask="1, 1, 0, 1" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="PartitionedCall/model/tf.__operators__.getitem_1/strided_slice:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="PartitionedCall/model/reshape_3/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="928" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/reshape_3/Reshape/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="PartitionedCall/model/reshape_3/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="PartitionedCall/model/reshape_3/Reshape:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="PartitionedCall/model/tf.__operators__.getitem_2/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="832" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem_2/strided_slice/stack:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="PartitionedCall/model/tf.__operators__.getitem_2/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="864" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem_2/strided_slice/stack_1:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="PartitionedCall/model/tf.__operators__.getitem_2/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="896" size="32"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/model/tf.__operators__.getitem_2/strided_slice/stack_2:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="PartitionedCall/model/tf.__operators__.getitem_2/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1" end_mask="1, 1, 0, 1" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="PartitionedCall/model/tf.__operators__.getitem_2/strided_slice:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="PartitionedCall/model/detection_out/concat" type="Concat" version="opset1">
			<data axis="3"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="Func/PartitionedCall/output/_4:0,Identity:0,PartitionedCall/Identity:0,PartitionedCall/model/detection_out/concat:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Func/PartitionedCall/output/_4:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>7</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="18" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="12" to-port="0"/>
		<edge from-layer="2" from-port="0" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="23" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="10" to-port="1"/>
		<edge from-layer="8" from-port="0" to-layer="10" to-port="2"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="3"/>
		<edge from-layer="10" from-port="4" to-layer="23" to-port="1"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="16" to-port="1"/>
		<edge from-layer="14" from-port="0" to-layer="16" to-port="2"/>
		<edge from-layer="15" from-port="0" to-layer="16" to-port="3"/>
		<edge from-layer="16" from-port="4" to-layer="23" to-port="2"/>
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="22" to-port="1"/>
		<edge from-layer="20" from-port="0" to-layer="22" to-port="2"/>
		<edge from-layer="21" from-port="0" to-layer="22" to-port="3"/>
		<edge from-layer="22" from-port="4" to-layer="23" to-port="3"/>
		<edge from-layer="23" from-port="4" to-layer="24" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.0-3839-cd81789d294-releases/2021/4"/>
		<cli_parameters>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="True"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model_is_text value="False"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="saved_model"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, input_shape, move_to_preprocess, output, placeholder_shapes, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
